БухЭксп/InformationRegisters/CW_СоставГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантПредставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыПредставленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаАктаОказанияУслуг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_ГруппыУслугСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ,СтандартнаяОбработка) Экспорт
	
	Элементы 	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") тогда
		ВидимостьГруппУслуг = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");	
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") тогда
		ВидимостьГруппУслуг = Объект.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");	
	КонецЕсли;	
		
	Элементы.ИспользуетсяОграниченияПоГруппамУслуг.Видимость 	= ВидимостьГруппУслуг;	
	Элементы.СтраницаГруппыУслуг.Видимость 						= Объект.ИспользуетсяОграниченияПоГруппамУслуг;
	
	УстановитьОтборСписка(Форма.ГруппыУслуг.Отбор, Объект.Ссылка) ;

КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Элементы 	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	УстановитьОтборСписка(Форма.ГруппыУслуг.Отбор, Объект.Ссылка) ;

КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	           
	Объект = Форма.Объект;
	
	Если НЕ ПолучитьФункциональнуюОпцию("CW_ИспользуютсяГруппыУслугДоговоровИПриложений") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		ВыполнитьПроверкуДляДоходовПоГрузоперевозке(Объект);
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		ВыполнитьПроверкуДляРасходовПоГрузоперевозке(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПроверкуДляДоходовПоГрузоперевозке(Объект)
	
	Если Не Объект.ФормируетсяАкт Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) и ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда
		Владелец = Объект.ПриложениеКДоговору;
	Иначе
		Владелец = Объект.Договор;
	КонецЕсли;
	
	Если Не Владелец.ИспользуетсяОграниченияПоГруппамУслуг Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставГруппУслуг.Услуга КАК Услуга
	               |ИЗ
	               |	РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	               |ГДЕ
	               |	CW_СоставГруппУслуг.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	МассивДопустимыхУслуг = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга");
	МассивПроверенных = Новый Массив;
	
	Для Каждого СтрокаТаблицы из Объект.Услуги Цикл
		
		Если СтрокаТаблицы.ПорядокОтражения <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга") Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивПроверенных.Найти(СтрокаТаблицы.Номенклатура) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивДопустимыхУслуг.Найти(СтрокаТаблицы.Номенклатура) = Неопределено Тогда
			
			ИндексСтроки = Объект.Услуги.Индекс(СтрокаТаблицы);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура """+ Строка(СтрокаТаблицы.Номенклатура) +""" не включена ни в одну из групп услуг договора (приложения): "+Строка(Владелец),,"Номенклатура["+ИндексСтроки+"].Количество","Объект");
			
		КонецЕсли;        
		
		МассивПроверенных.Добавить(СтрокаТаблицы.Номенклатура);
		
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьПроверкуДляРасходовПоГрузоперевозке(Объект)
	
	Если Не Объект.ПредъявленАкт Тогда
		Возврат;
	КонецЕсли;

	ВедетсяУчетПриложений = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) и ВедетсяУчетПриложений Тогда
		ОбъектПараметров = Объект.ПриложениеКДоговору;
	Иначе
		ОбъектПараметров = Объект.Договор;
	КонецЕсли;

	ПроверятьПокупателяИДоговор = CW_Настройки.ПолучитьЗначениеПараметраДоговора(Объект.Дата, 
									ОбъектПараметров, 
									"ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах");
	
	Если Не ПроверятьПокупателяИДоговор Тогда
		Возврат;
	КонецЕсли;
																			
	//Получим массив владельцев
	мВладельцы = Новый Массив;
	Для Каждого СтрокаТаблицы из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПриложениеКДоговору) и ВедетсяУчетПриложений Тогда
			ИмяРеквизитаТаблицы 			= "ПриложениеКДоговору";
			ИмяВторичногоРеквизитаТаблицы 	= "ДоговорПокупателя";
		Иначе
			ИмяРеквизитаТаблицы 			= "ДоговорПокупателя";
			ИмяВторичногоРеквизитаТаблицы 	= "ДоговорПокупателя";
		КонецЕсли;
		
		ЗначениеРеквизита = СтрокаТаблицы[ИмяРеквизитаТаблицы];
		Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			ЗначениеРеквизита = СтрокаТаблицы[ИмяВторичногоРеквизитаТаблицы];
		КонецЕсли;
		Если  ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Если мВладельцы.Найти(ЗначениеРеквизита) = Неопределено 
				И ЗначениеРеквизита.ИспользуетсяОграниченияПоГруппамУслуг Тогда
				мВладельцы.Добавить(ЗначениеРеквизита);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если мВладельцы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	//Получим массив владельцев
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставГруппУслуг.Владелец КАК Владелец,
	               |	CW_СоставГруппУслуг.Услуга КАК Услуга
	               |ИЗ
	               |	РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	               |ГДЕ
	               |	CW_СоставГруппУслуг.Владелец В(&мВладельцы)";
	
	Запрос.УстановитьПараметр("мВладельцы", мВладельцы);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДоступныхУслуг = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрокаТаблицы из Объект.Услуги Цикл
		
		Если СтрокаТаблицы.ПорядокОтражения <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты") Тогда
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТаблицы.ПриложениеКДоговору) и ВедетсяУчетПриложений Тогда
			ИмяРеквизитаТаблицы 			= "ПриложениеКДоговору";
			ИмяВторичногоРеквизитаТаблицы 	= "ДоговорПокупателя";
		Иначе
			ИмяРеквизитаТаблицы 			= "ДоговорПокупателя";
			ИмяВторичногоРеквизитаТаблицы 	= "ДоговорПокупателя";
		КонецЕсли;
	
		ВыборкаДоступныхУслуг.Сбросить();
		
		Владелец = СтрокаТаблицы[ИмяРеквизитаТаблицы];
		Если Не ЗначениеЗаполнено(Владелец) Тогда
			Владелец = СтрокаТаблицы[ИмяВторичногоРеквизитаТаблицы];
		КонецЕсли;
		
		Если НЕ Владелец.ИспользуетсяОграниченияПоГруппамУслуг Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Владелец",	Владелец);
		СтруктураПоиска.Вставить("Услуга", 		СтрокаТаблицы.Номенклатура);
		
		Если НЕ ВыборкаДоступныхУслуг.НайтиСледующий(СтруктураПоиска) Тогда
			ИндексСтроки = Объект.Услуги.Индекс(СтрокаТаблицы);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура """+ Строка(СтрокаТаблицы.Номенклатура) +""" не включена ни в одну из групп услуг договора (приложения): "+Строка(Владелец),,"Номенклатура["+ИндексСтроки+"].Количество","Объект");
		КонецЕсли;        
		
		
	КонецЦикла;

КонецПроцедуры



Процедура УстановитьОтборСписка(Отбор, Ссылка)
	
	Отбор.Элементы.Очистить();
	ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= Ссылка;
	ЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры

Процедура ПродолжитьУдалениеГруппыУслугНаСервере(КлючЗаписи) Экспорт
	
	РегистрыСведений.CW_СоставГруппУслуг.УдалитьЗаписиРегистра(КлючЗаписи);
	РегистрыСведений.CW_ХарактеристикиГруппУслуг.УдалитьЗаписьРегистра(КлючЗаписи);
	
КонецПроцедуры

Функция ПроверитьВозможностьЗаписиСУчетомОграничений(Объект, Отказ) Экспорт
	
	Если Объект.ИспользуетсяОграниченияПоГруппамУслуг Тогда
		ЗаполненоОграничениеУслугПоГруппам = РегистрыСведений.CW_СоставГруппУслуг.ЗаполненоОграничениеУслугПоГруппам(Объект.Ссылка);
		Если Не ЗаполненоОграничениеУслугПоГруппам тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При включенной опуции ""используется ограничения по группам услуг"" обязательно заполнение списка групп услуг!",,"ИспользуетсяОграниченияПоГруппамУслуг","Объект",Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
